#include<iostream>
using namespace std;

class complex_numbers{

private:
int a,b,c,z,z1,z2,z3,z4,z5,z6;
int i = -1;

public:

    //конструкт
    complex_numbers(int index1, int index2, int index3){
        
        cout << "Конструкт\n\n";
        a = index1;
        b = index2;
        c = index3;
        z = a + b * i;
        z1 = a * c + b * c * i;
        z2 = (a/c) + (b/c) * i;
        z3 = (a + 1) + b * i;
        z4 = a + (b + 1) * i;
        z5 = (a - 1) + b * i;
        z6 = a + (b - 1) * i;

        cout<< "Формула: z = a + b * i " <<"\nКомплексне число дорівнює: " << z << "\n" << "a - " << a << "; b - " << b << "; i - " << i << "\n\n";
        cout<< "Формула: z = a * c + b * c * i " <<"\nКомплексне число дорівнює: " << z1 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = (a/c) + (b/c) * i " <<"\nКомплексне число дорівнює: " << z2 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = (a + 1) + b * i " <<"\nКомплексне число дорівнює: " << z3 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = a + (b + 1) * i " <<"\nКомплексне число дорівнює: " << z4 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = (a - 1) + b * i " <<"\nКомплексне число дорівнює: " << z5 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = a + (b - 1) * i " <<"\nКомплексне число дорівнює: " << z6 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";


    };
    //-+

    //Деконструкт
    ~complex_numbers(){

        cout<< "\n\nДеконструкт\n\n";
        cout<< "Формула: z = a + b * i " <<"\nКомплексне число дорівнює: " << z << "\n" << "a - " << a << "; b - " << b << "; i - " << i << "\n\n";
        cout<< "Формула: z = a * c + b * c * i " <<"\nКомплексне число дорівнює: " << z1 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = (a/c) + (b/c) * i " <<"\nКомплексне число дорівнює: " << z2 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = (a + 1) + b * i " <<"\nКомплексне число дорівнює: " << z3 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = a + (b + 1) * i " <<"\nКомплексне число дорівнює: " << z4 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = (a - 1) + b * i " <<"\nКомплексне число дорівнює: " << z5 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";
        cout<< "Формула: z = a + (b - 1) * i " <<"\nКомплексне число дорівнює: " << z6 << "\n" << "a - " << a << "; b - " << b << "; c - "<< c << "; i - " << i << "\n\n";

    }
    //-++

};




int main(){
    string n,m,b;
    int index1, index2, index3;

    cout << "Ведіть значення: \n";
    while(true){
        cout << "a: ";
        cin >> n;
        
        try{

            index1 = stoi(n);

        }catch(...){

            cout << "Число має бути цілим!";

        }

        
        cout << "b: ";
        cin >> m;
        
        try{

            index2 = stoi(m);

        }catch(...){

            cout << "Число має бути цілим!";

        }   

        cout << "c: ";
        cin >> b;
        
        try{

            index3 = stoi(b);

        }catch(...){

            cout << "Число має бути цілим!";

        }   

        break;

    }

    
    complex_numbers p1(index1, index2, index3);

    

return 0;
}